within ;
package Data
  // Пример готовых пресетов типов генераторов:

  constant PQ_CapabilityTable TVV_500_2 = PQ_CapabilityTable(
    P_max = {0, 50, 100, 150, 200, 250, 300, 350, 400, 450, 500}, Qmax = {410, 410, 410, 410, 400, 400, 390, 380, 360, 340, 310},
    P_min = {0, 50, 100, 150, 200, 250, 300, 350, 400, 450, 500}, Qmin = {-140, -130, -120, -115, -110, -95, -80, -65, -50, -30, -15})
    "Турбогенератор ТВВ-500-2";

  constant PQ_CapabilityTable TF_100_2 = PQ_CapabilityTable(
    P_max = {0, 10, 20, 30, 40, 50, 60, 70, 80, 90, 100}, Qmax = {113, 112, 111, 110, 107, 105, 102, 98, 94, 90, 85},
    P_min = {0, 10, 20, 30, 40, 50, 60, 70, 80, 90, 100}, Qmin = {-5, -9, -12, -16, -20, -23, -27, -23, -19, -16, -12})
    "Турбогенератор ТФ-100-2";

  constant PQ_CapabilityTable TGV_320_2_UZ = PQ_CapabilityTable(
    P_max = {0, 30, 60, 90, 120, 150, 180, 210, 240, 270, 300}, Qmax = {250, 250, 250, 250, 245, 240, 235, 220, 210, 200, 180},
    P_min = {0, 30, 60, 90, 120, 150, 180, 210, 240, 270, 300}, Qmin = {-100, -100, -99, -98, -96, -91, -83, -75, -66, -56, -46})
    "Турбогенератор ТГВ-300-2УЗ";

  annotation (Icon(graphics={Bitmap(extent={{-154,-108},{164,100}}, fileName=
              "modelica://LEPSE/Images/Data.png")}));
end Data;
